"use strict";

module.exports = {
    // Кол-во хп при использования аптечки (самолечение)
    medHealth: 20,
    // Кол-во хп при использования пластыря (самолечение)
    patchHealth: 5,
    // Макс. кол-во хп при использовании аптечки/пластыря (самолечение)
    medMaxHealth: 80,
    // Цена за леченеие 1 ХП игрока (предложение лечения)
    healingPrice: 1,
    // Кол-во боеприпасов, списываемое за выдачу формы
    clothesAmmo: 0,
    // Кол-во боеприпасов, списываемое за выдачу снаряжения
    itemAmmo: 100,
};
